#include <iostream>
#include <locale>


using namespace std;
double *masiv(int);
double sum(double *, int);
double average(double *, int);
double *zero(double *, int);
double *min(double *, int);
double *end(double *, int, double, double, double *, double *);


int main()
{
	setlocale (LC_ALL, "bulgarian");
	int izbor,size;
	double ave = NULL;
	double *p = NULL, *c = NULL,*d = NULL,*z = NULL, a = NULL;
	do{
		cout<<"Изберете условие от задачата"<<endl;
		cout<<"1 Въвеждане на масив от реални числа"<<endl;
		cout<<"2 Изчисляване на сумата от положителни числа в масива"<<endl;
		cout<<"3 Изчисляване на средно-аритметичното от отрицателните числа в масива"<<endl;
		cout<<"4 Изчисляване на произведението на различните от нула числа и броя на нулевите числа в масива"<<endl;
		cout<<"5 Намиране на минималното положително число в масива и неговия пореден номер"<<endl;
		cout<<"6 Извеждане на резултата на всички изчисления и въведените числа в масива"<<endl;
		cout<<"7 Изход"<<endl;
		do{
			cout<<"Моля изберете условие: "<<endl;
			cin>>izbor;}
		while((izbor<1)||(izbor>7));
		switch(izbor)
		{
		case 1: 
			do{
				cout<<"________________________________________________________________________________"<<endl;
				cout<<"Колко числа искате да въведете (вашите числа не трябва да са повече от 30)"<<endl;
				cout<<"________________________________________________________________________________"<<endl;
				cin>>size;
			}while ((size>30) || (size<0));
			p=masiv(size);

			break;
		case 2: 
			if ((p == NULL) || (size == NULL)){
				cout<<"________________________________________________________________________________"<<endl;
				cout<<"Моля въведете първо масива и неговата големина от условие 1."<<endl;
				cout<<"________________________________________________________________________________"<<endl;
				break;
			}
			a=sum(p,size);
			break;
		case 3: 
			if ((p == NULL) || (size == NULL)){
				cout<<"________________________________________________________________________________"<<endl;
				cout<<"Моля въведете първо масива и неговата големина от условие 1."<<endl;
				cout<<"________________________________________________________________________________"<<endl;
				break;
			}
			ave=average (p,size);
			break;
		case 4:
			if ((p == NULL) || (size == NULL)){
				cout<<"________________________________________________________________________________"<<endl;
				cout<<"Моля въведете първо масива и неговата големина от условие 1."<<endl;
				cout<<"________________________________________________________________________________"<<endl;
				break;
			}
			c=zero (p,size);
			break;
		case 5:
			if ((p == NULL) || (size == NULL)){
				cout<<"________________________________________________________________________________"<<endl;
				cout<<"Моля въведете първо масива и неговата големина от условие 1."<<endl;
				cout<<"________________________________________________________________________________"<<endl;
				break;
			}
			d=min (p,size);
			break;
		case 6:
			if ((p == NULL) || (size == NULL)){
				cout<<"________________________________________________________________________________"<<endl;
				cout<<"Моля въведете първо масива и неговата големина от условие 1."<<endl;
				cout<<"________________________________________________________________________________"<<endl;
				break;
			}
			z=end(p,size,a,ave,c,d);
			break;
		}
	}while (izbor!=7);
}




double * masiv(int size)
{
	static double array[30];
	cout<<"________________________________________________________________________________"<<endl;
	cout<<"Въведете вашите числа "<<endl;
	cout<<"________________________________________________________________________________"<<endl;
	for(int i=0;i<size;i++)
	{
		cin >> array[i];
	}

	return array;

}



double  sum(double *p, int size)
{
	double s=0;
	for(int i=0;i<size;i++)
	{
		if(p[i]>0){
			s=s+p[i];
		}
	}
	if (s==0){
		cout<<"________________________________________________________________________________"<<endl;
		cout<<"Няма положителни числа"<<endl;
		cout<<"________________________________________________________________________________"<<endl;
	}
	else{
		cout<<"________________________________________________________________________________"<<endl;
		cout<<"Сумата от положителните числа е: "<<s<<endl;
		cout<<"________________________________________________________________________________"<<endl;
	}
	return s;
}


double average(double *p, int size)
{
	double ave=0, s=0;
	int i, n=0;
	for(i=0;i<size;i++)
	{
		if(p[i]<0){
			n++;
		}
	}
	for(i=0;i<size;i++)
	{
		if(p[i]<0){
			s=s+p[i];
			ave=s/n;
		}
	}
	if(n==0){
		ave = 0;
		cout<<"________________________________________________________________________________"<<endl;
		cout<<"Няма отрицателни числа"<<endl;
		cout<<"________________________________________________________________________________"<<endl;
	}
	else{
		cout<<"________________________________________________________________________________"<<endl;
		cout<<"Средното-аритметично число от отрицателните числа е: "<<ave<<endl;
		cout<<"________________________________________________________________________________"<<endl;
	}
	return ave;
}



double *zero(double *p, int size)
{
	static double b[2];
	double c=1;
	int n=0;
	for(int i=0;i<size;i++)
	{
		if(p[i]!=0){
			c=c*p[i];
		}
	}
	cout<<"________________________________________________________________________________"<<endl;
	cout<<"Произведението на различните от нула числа е: "<<c<<endl;
	for(int i=0;i<size;i++)
	{
		if(p[i]==0){
			n++;
		}
	}
	if(n==0){ 
		cout<<"Няма нулеви числа"<<endl; 
	} 
	else if(n==1) 
	{ 
		cout<<"Има само едно нулево число"<<endl; 
	} 
	else 
	{ 
		cout<<"Броя на нулевите числа е: "<<n<<endl; 
	} 
	cout<<"________________________________________________________________________________"<<endl;
	b[0]=c;
	b[1]=n;
	return b;
}


double *min(double *p, int size)
{
	static double c[2];
	double b[30], min;
	int br=0,z;
	for (int i=0; i<size; i++)
	{
		if (p[i]>=0){
			b[br]=p[i];
			br++;
		}
	}	
	min=b[0];
	for (int j=1; j<br; j++)
	{
		if (b[j] < min)
		{
			min = b[j];

		}
	}
	bool flag=false;
	for (int i=0; i<size; i++)
	{
		if (p[i]==min){
			z=i+1;
			flag=true;
			break;
		}
	}
	if (br==0)
	{
		cout<<"________________________________________________________________________________"<<endl;
		cout<<"Няма положителни числа"<<endl;
		cout<<"________________________________________________________________________________"<<endl;
	}
	else {
		cout<<"________________________________________________________________________________"<<endl;
		cout<<"Най-малкото положително число е: "<<min<<endl;
		cout<<"Неговия пореден номер е: "<<z<<endl;
		cout<<"________________________________________________________________________________"<<endl;
	}
	c[0]=min;
	c[1]=z;
	return c;
}


double *end (double * array,int size, double a, double ave, double * c , double * d)
{
	cout<<"________________________________________________________________________________"<<endl;
	if (array !=NULL){
		cout<<"Вашите числа са: ";
		for(int i=0;i<size;i++){
			cout<<array[i]<<"; ";
		}
		cout<<endl;
	}
	if (a !=NULL){
		cout<<"Сумата от положителните числа е: "<<a<<endl;
	}
	if (ave !=NULL){
		cout<<"Средното-аритметично число от отрицателните числа е: "<<ave<<endl;
	}
	if (c !=NULL){
		cout<<"Произведението на различните от нула числа е: "<<c[0]<<endl;
		if (c[1]==0){
			cout<<"Няма нулеви числа"<<endl;
		}
		else if (c[1]==1){
			cout<<"Има само едно нулево число"<<endl;
		}
		else{
			cout<<"Броя на нулевите числа е: "<<c[1]<<endl;
		}
	}
	if (d !=NULL){
		cout<<"Най-малкото положително число е: "<<d[0]<<endl;
		cout<<"Неговия пореден номер е: "<<d[1]<<endl;
	}
	cout<<"________________________________________________________________________________"<<endl;
	return 0;
}
